
$.ig = $.ig || {};
$.ig.datalayer = $.ig.datalayer || {};
$.ig.datalayer.strings =
{
    
      "DatabasesGroupLabel" : "Базы данных",
    
      "date" : "дата",
    
      "day" : "день",
    
      "ExpErrorFunctionNotFound" : "#ИМЯ \"{0}\"",
    
      "ExpErrorWrongParameterCount" : "Неверное количество параметров, передаваемых функции {0}",
    
      "ExpHelpDate" : "Возвращает дату, заданную для текущего года, месяца, дня, часов, минут и секунд. Аргументы являются необязательными.",
    
      "ExpHelpDay" : "Returns the day of the month, a number from 1 to 31.",
    
      "ExpHelpHour" : "Возвращает значение часов в дате или времени – число от 0 до 23.",
    
      "ExpHelpIf" : "Возвращает одно из двух значений в зависимости от результата логического теста.",
    
      "ExpHelpMillisecond" : "Возвращает значение миллисекунд в дате или времени – число от 0 до 999.",
    
      "ExpHelpMinute" : "Returns the minute of the date or time, a number from 0 to 59.",
    
      "ExpHelpSecond" : "Возвращает значение секунд в дате или времени – число от 0 до 59.",
    
      "ExpHelpTime" : "Возвращает время, заданное указанными значениями часов, минут, секунд и миллисекунд. Аргументы являются необязательными.",
    
      "hour" : "час",
    
      "logical_test" : "логический тест",
    
      "millisecond" : "миллисекунда",
    
      "minute" : "минута",
    
      "month" : "месяц",
    
      "number" : "число",
    
      "second" : "секунда",
    
      "TablesGroupLabel" : "Таблицы",
    
      "value" : "значение",
    
      "value_if_false" : "значение, если ложь",
    
      "value_if_true" : "значение, если правда",
    
      "ViewsGroupLabel" : "Представления",
    
      "year" : "год",
    
      "ExpErrorParameterNotSet" : "Не задан параметр \"{0}\"",
    
      "ExpCategoryDate" : "Дата",
    
      "ExpCategoryInformation" : "Информация",
    
      "ExpCategoryLogic" : "Логический",
    
      "ExpHelpEmpty" : "Возвращает значение EMPTY.",
    
      "ExpHelpIsempty" : "Возвращает 1 для пустого значения или 0 в противном случае.",
    
      "ExpHelpTrim" : "Возвращает новую текстовую строку, аналогичную указанной текстовой строке, но с удаленными пробелами в начале и конце.",
    
      "ExpHelpAnd" : "Возвращает 1, если ни один из аргументов не равен 0. Может получать любое число аргументов.",
    
      "ExpHelpFalse" : "Возвращает 0 – логическое значение \"ложь\".",
    
      "ExpHelpNot" : "Возвращает 1 для значения 0 или 0 для значения 1.",
    
      "ExpHelpOr" : "Возвращает 1, если как минимум один из аргументов равен 1, или 0, если это условие не выполнено. Может получать любое число аргументов.",
    
      "ExpHelpTrue" : "Возвращает 1 – логическое значение \"истина\".",
    
      "ExpHelpMonth" : "Возвращает значение месяца в дате – число от 1 до 12.",
    
      "ExpHelpYear" : "Возвращает год для указанной даты.",
    
      "ExpHelpNow" : "Возвращает текущие дату и время.",
    
      "ExpHelpToday" : "Возвращает текущую дату.",
    
      "ExpHelpQuarter" : "Возвращает значение квартала в дате – число от 1 до 4.",
    
      "ExpHelpWeekday" : "Возвращает значение дня недели – число от 1 до 7.",
    
      "ExpHelpFyear" : "Возвращает финансовый год для указанной даты (например, ФГ 2012).",
    
      "ExpHelpWeeknum" : "Возвращает значение недели для указанной даты – число от 1 до 56.",
    
      "ExpHelpMonthname" : "Возвращает название месяца для указанной даты. \"позиция\" – необязательные аргумент.",
    
      "ExpHelpMonthshortname" : "Возвращает название месяца для указанной даты в кратком формате. \"позиция\" – необязательные аргумент.",
    
      "ExpHelpDatevalue" : "Возвращает дату, полученную из указанного текста, в формате, заданном вторым параметром. Позиция задается двузначным идентификатором. Format and locale are optional arguments",
    
      "ExpHelpFormatdate" : "Возвращает текст с датой в заданном формате. \"позиция\" – необязательные аргумент.",
    
      "locale" : "позиция",
    
      "text" : "текст",
    
      "MYSQL" : "MySQL",
    
      "SQLSERVER" : "Microsoft SQL Server",
    
      "length" : "длина",
    
      "ExpHelpAverage" : "Возвращает среднее значение результата для всех строк.",
    
      "ExpHelpAverageif" : "Возвращает среднее значение результата для всех строк, в которых логический тест дает значение \"истина\".",
    
      "ExpHelpConcatenate" : "Возвращает текстовую строку, составленную из нескольких текстовых строк. Может получать любое число аргументов.",
    
      "ExpHelpFind" : "Возвращает начальную позицию текстовой строки внутри другой текстовой строки.",
    
      "ExpHelpLen" : "Returns the number of characters in a text string.",
    
      "ExpHelpLower" : "Преобразует все знаки верхнего регистра в знаки нижнего регистра.",
    
      "ExpHelpMid" : "Возвращает подстроку указанной текстовой строки.",
    
      "ExpHelpReplace" : "Возвращает текстовую строку, в которой указанная текстовая строка заменена другой текстовой строкой.",
    
      "ExpHelpSortinterval" : "Сортирует значение в соответствии с диапазоном. Возвращает строку формата \"NN [от, до]\".",
    
      "ExpHelpUpper" : "Converts all lowercase characters to uppercase characters.",
    
      "find_text" : "найти текст",
    
      "format" : "формат",
    
      "new_text" : "новый текст",
    
      "old_text" : "старый текст",
    
      "start" : "начало",
    
      "start_number" : "начальный номер",
    
      "within_text" : "в тексте",
    
      "ExpHelpCount" : "Возвращает количество строк.",
    
      "ExpHelpCountif" : "Возвращает количество строк, в которых логический тест дает значение \"истина\".",
    
      "ExpHelpExp" : "Возвращает \"e\" в указанной степени.",
    
      "ExpHelpIsdate" : "Возвращает 1 для даты или 0 в противном случае.",
    
      "ExpHelpIsdatetime" : "Возвращает 1 для даты или 0 в противном случае.",
    
      "ExpHelpIsnumber" : "Возвращает 1 для числового значения или 0 в противном случае.",
    
      "ExpHelpIstext" : "Возвращает 1 для текстовой строки или 0 в противном случае.",
    
      "ExpHelpIstime" : "Возвращает 1 для времени или 0 в противном случае.",
    
      "ExpHelpLog" : "Возвращает логарифм числа по указанному основанию. Если аргумент основания не указан, берется основание 10.",
    
      "ExpHelpLog10" : "Возвращает логарифм числа по основанию 10.",
    
      "ExpHelpMax" : "Возвращает максимальное значение результата для всех строк.",
    
      "ExpHelpMaxif" : "Возвращает максимальное значение результата для всех строк, в которых логический тест дает значение \"истина\".",
    
      "ExpHelpMin" : "Возвращает минимальное значение результата для всех строк.",
    
      "ExpHelpMinif" : "Возвращает минимальное значение результата для всех строк, в которых логический тест дает значение \"истина\".",
    
      "ExpHelpMod" : "Возвращает остаток от целочисленного деления.",
    
      "ExpHelpPrevious" : "Возвращает результат выражения, вычисленного в предыдущей строке. Значение можно задать для первой строки.",
    
      "ExpHelpRand" : "Возвращает случайное число от 0 до 1.",
    
      "ExpHelpRandbetween" : "Returns an integer number between the two given parameters. Возвращаемые числа равномерно распределены.",
    
      "ExpHelpRow" : "Возвращает номер текущей строки.",
    
      "ExpHelpSign" : "Возвращает -1 для отрицательного числа, 0 для 0 и +1 для положительного числа.",
    
      "ExpHelpSqrt" : "Возвращает квадратный корень указанного числа.",
    
      "ExpHelpStdev" : "Возвращает стандартное отклонение значений результата для всех строк.",
    
      "ExpHelpStdevif" : "Возвращает стандартное отклонение значений результата для всех строк, в которых логический тест дает значение \"истина\".",
    
      "ExpHelpSum" : "Добавляет значение результата для каждой строки.",
    
      "ExpHelpSumif" : "Добавляет значение результата для каждой строки, в которой логический тест дает значение \"истина\".",
    
      "ExpHelpTrunc" : "Возвращает целую часть числа.",
    
      "ExpHelpVar" : "Возвращает дисперсию значений результата для всех строк.",
    
      "ExpHelpVariable" : "Возвращает значение указанной глобальной переменной.",
    
      "ExpHelpVarif" : "Возвращает дисперсию значений результата для всех строк, в которых логический тест дает значение \"истина\".",
    
      "ExpHelpAbs" : "Возвращает абсолютное значение числа.",
    
      "ExpHelpFquarter" : "Возвращает квартал финансового года для указанной даты.",
    
      "bottom" : "низ",
    
      "divisor" : "делитель",
    
      "expression" : "выражение",
    
      "first_value" : "первое значение",
    
      "if_condition" : "условие",
    
      "log_base" : "основание",
    
      "logical1" : "логический1",
    
      "logical2" : "логический2",
    
      "name" : "имя",
    
      "top" : "верх",
    
      "FYExpression" : "ФГ {0}",
    
      "DYNAMICS_CRM" : "Microsoft Dynamics CRM",
    
      "ExpCategoryLookupandreference" : "Поиск и ссылка",
    
      "ExpCategoryMath" : "Матем.",
    
      "ExpCategoryString" : "Строка",
    
      "ExpCategoryAggregation" : "Объединение",
    
      "SALESFORCE" : "SalesForce",
    
      "grand_total" : "Общий итог",
    
      "CSVLOCALFILEPROVIDER" : "CSV",
    
      "EXCELLOCALFILEPROVIDER" : "EXCEL",
    
      "GOOGLE_ANALYTICS" : "Google Analytics",
    
      "ProfilesGroupLabel" : "Профили",
    
      "InMemory" : "В памяти",
    
      "APPFIGURES" : "AppFigures",
    
      "ODATAPROVIDER" : "OData",
    
      "OData_BadServiceUrl" : "Указанный URL-адрес не является допустимой службой OData.",
    
      "OData_VersionNotSupported" : "OData версии {0} не поддерживается.",
    
      "datetime" : "дата-время",
    
};
  